ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/MAILBOX0_MAILBOX_CLUSTER_3_REGS3.xml
	<register id="REGS3_MAILBOX_IRQ_ENABLE_CLR" acronym="REGS3_MAILBOX_IRQ_ENABLE_CLR" offset="0x10C" width="32" description="The interrupt enable register allows software to mask/unmask the module internal source of interrupt for the user [a].
Read value is the current enable bits for each interrupt sourc.
Write 1 to a bit disables an interrupt source. 
Write 0 has no effect.">
		<bitfield id="NOTFULLENABLEMB15" width="1" begin="31" end="31" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="31" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB15" width="1" begin="30" end="30" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="30" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB14" width="1" begin="29" end="29" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="29" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB14" width="1" begin="28" end="28" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="28" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB13" width="1" begin="27" end="27" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="27" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB13" width="1" begin="26" end="26" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="26" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB12" width="1" begin="25" end="25" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="25" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB12" width="1" begin="24" end="24" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="24" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB11" width="1" begin="23" end="23" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="23" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB11" width="1" begin="22" end="22" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="22" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB10" width="1" begin="21" end="21" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="21" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB10" width="1" begin="20" end="20" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="20" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB9" width="1" begin="19" end="19" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="19" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB9" width="1" begin="18" end="18" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="18" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB8" width="1" begin="17" end="17" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="17" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB8" width="1" begin="16" end="16" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="16" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB7" width="1" begin="15" end="15" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="15" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB7" width="1" begin="14" end="14" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="14" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB6" width="1" begin="13" end="13" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="13" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB6" width="1" begin="12" end="12" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="12" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB5" width="1" begin="11" end="11" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="11" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB5" width="1" begin="10" end="10" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="10" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB4" width="1" begin="9" end="9" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="9" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB4" width="1" begin="8" end="8" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="8" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB3" width="1" begin="7" end="7" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="7" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB3" width="1" begin="6" end="6" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="6" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB2" width="1" begin="5" end="5" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="5" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB2" width="1" begin="4" end="4" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="4" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB1" width="1" begin="3" end="3" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="3" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB1" width="1" begin="2" end="2" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="2" rwaccess="R/W"/> 
		<bitfield id="NOTFULLENABLEMB0" width="1" begin="1" end="1" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="1" rwaccess="R/W"/> 
		<bitfield id="NEWMSGENABLEMB0" width="1" begin="0" end="0" resetval="0x0" description="Read value is current enable state for this interrupt. Write 1 disables the interrupt. Write 0 does nothing." range="0" rwaccess="R/W"/>
	</register>
</module>